## Problem: Find Second Highest Salary

#### Table: Employee

| Column Name | Type |
|-------------|------|
| id          | int  |
| salary      | int  |

id is the primary key (column with unique values) for this table.
Each row of this table contains information about the salary of an employee.
 

Write a solution to find the second highest distinct salary from the Employee table. If there is no second highest salary, return null (return None in Pandas).

The result format is in the following example.

### Example 1:

Input: 
Employee table:

| id | salary |
|----|--------|
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |

Output: 

| SecondHighestSalary |
|---------------------|
| 200                 |

### Example 2:

Input: 
Employee table:

| id | salary |
|----|--------|
| 1  | 100    |

Output: 

| SecondHighestSalary |
|---------------------|
| null                |

In [2]:
import pandas as pd

In [122]:
data_1 = [[1, 100], [2, 200], [3, 300]]
data_2 = [[1, 100]]
data_3 = [[1, 100], [2, 100]]

case_1 = pd.DataFrame(data_1, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})
case_2 = pd.DataFrame(data_2, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})
case_3 = pd.DataFrame(data_3, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

In [126]:
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    unique_salaries = employee.drop_duplicates(subset='salary').sort_values(by='salary', ascending=False)
    if len(unique_salaries) < 2:
        return pd.DataFrame({'SecondHighestSalary': [None]})
    else:
        second_highest = unique_salaries.iloc[1].to_list()
        return pd.DataFrame({'SecondHighestSalary': [second_highest[1]]})

In [ ]:
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    sorted_salaries = employee['salary'].sort_values(ascending=False).drop_duplicates()
    return pd.DataFrame({'SecondHighestSalary': [None if sorted_salaries.size < 2 else sorted_salaries.iloc[1]]})

In [132]:
second_highest_salary(case_1)

   SecondHighestSalary
0                  200

In [129]:
second_highest_salary(case_2)

  SecondHighestSalary
0                None

In [127]:
second_highest_salary(case_3)

  SecondHighestSalary
0                None